package com.example.rifat.busticket;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class ShowLong extends AppCompatActivity {
    TextView tv1,tv2;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_show_long);

        tv1 = findViewById(R.id.tv1);
        tv2 = findViewById(R.id.tv2);

        String data = getIntent().getExtras().getString("key");
        if (data.equals("1")){
            tv1.setText("বাস রুট ও বাস ভাড়া : ");
            tv2.setText("Dhaka To Chittagong \n" +
                    "Non AC: 430 Taka\n" +
                    "AC: 900-1100 Taka\n" +
                    "\n" +
                    "Dhaka To Cox’s Bazar\n" +
                    "\n" +
                    "Non AC: 700 Taka (Ramu)\n" +
                    "800 Taka (Teknaf)\n" +
                    "AC: 1400 Taka (Economy)\n" +
                    "AC: 2000 Taka (Executive)\n" +
                    "\n" +
                    "Dhaka To Shylet\n" +
                    "Non AC: 450 Taka\n" +
                    "\n" +
                    "Dhaka To Rajshahi\n" +
                    "Non AC: 600 Taka\n" +
                    "\n" +
                    "Dhaka ToNatore\n" +
                    "Non AC: 600 Taka\n" +
                    "\n" +
                    "Dhaka To Rangpur\n" +
                    "Non AC: 500 Taka\n" +
                    "\n" +
                    "Dhaka To Khulna\n" +
                    "Non AC: 550 Taka  ");


        } else if(data.equals("2")){

            tv1.setText("বাস রুট ও বাস ভাড়া : ");
            tv2.setText("কক্সবাজার\n" +
                    "\n" +
                    "১১৫০\n" +
                    "\n" +
                    "৭০০\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "৭৫০\n" +
                    "\n" +
                    "৪৩০\n" +
                    "\n" +
                    "খাগড়াছড়ি\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৫২০\n" +
                    "\n" +
                    "বান্দরবান\n" +
                    "\n" +
                    "৭৫০\n" +
                    "\n" +
                    "৫৫০\n" +
                    "\n" +
                    "রাঙামাটি\n" +
                    "\n" +
                    "৭৫০\n" +
                    "\n" +
                    "৫৪০\n" +
                    "\n" +
                    "রংপুর\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৫০০\n" +
                    "\n" +
                    "দিনাজপুর\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৫০০\n" +
                    "\n" +
                    "নওগাঁও\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪২০\n" +
                    "\n" +
                    "বগুড়া\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৩৫০\n" +
                    "\n" +
                    "হিলি\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪৫০\n" +
                    "\n" +
                    "গাইবান্ধা\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪৫০\n" +
                    "\n" +
                    "পাবনা\n" +
                    "\n" +
                    "৪৫০\n" +
                    "\n" +
                    "৩৭০\n" +
                    "\n" +
                    "কলকাতা\n" +
                    "\n" +
                    "১৫০০\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "শিলিগুড়ি\n" +
                    "\n" +
                    "১৩০০\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "আগরতলা\n" +
                    "\n" +
                    "৩০০\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "সিলেট\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪৫০\n" +
                    "\n" +
                    "মৌলভীবাজার\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৩৫০\n" +
                    "\n" +
                    "বিয়ানীবাজার\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪৫০\n" +
                    "\n" +
                    "রাজশাহী\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "৪২০ ");

        } else if(data.equals("3")){

            tv1.setText("বাস রুট ও বাস ভাড়া : ");
            tv2.setText("০১.\n" +
                    "\n" +
                    "ঢাকা – চট্টগ্রাম – ঢাকা\n" +
                    "\n" +
                    "৯৫০ টাকা\n" +
                    "\n" +
                    "০২.\n" +
                    "\n" +
                    "ঢাকা – কক্সবাজার – ঢাকা\n" +
                    "\n" +
                    "১,৫২৫ টাকা\n" +
                    "\n" +
                    "০৩.\n" +
                    "\n" +
                    "ঢাকা – সিলেট – ঢাকা\n" +
                    "\n" +
                    "এক্সিকিউটিভ\n" +
                    "\n" +
                    "রেগুলার\n" +
                    "\n" +
                    "১,১০০ টাকা\n" +
                    "\n" +
                    "৯০০ টাকা\n" +
                    "\n" +
                    "০৪.\n" +
                    "\n" +
                    "ঢাকা – যশোর – ঢাকা\n" +
                    "\n" +
                    "১,১০০ টাকা\n" +
                    "\n" +
                    "৯০০ টাকা\n" +
                    "\n" +
                    "০৫.\n" +
                    "\n" +
                    "ঢাকা - খুলনা - ঢাকা\n" +
                    "\n" +
                    "১,২০০ টাকা\n" +
                    "\n" +
                    "১,০০০ টাকা\n" +
                    "\n" +
                    "০৬.\n" +
                    "\n" +
                    "ঢাকা – বেনাপোল\n" +
                    "\n" +
                    "১,২৭০ টাকা\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "ঢাকা - কলকাতা:\n" +
                    "\n" +
                    "এসি\n" +
                    "\n" +
                    "বিজনেস ক্লাস\n" +
                    "\n" +
                    "১,৫২০/-\n" +
                    "\n" +
                    "রেগুলার ক্লাস\n" +
                    "\n" +
                    "১,৩২০/-\n" +
                    "\n" +
                    "নন-এসি\n" +
                    "\n" +
                    "---\n" +
                    "\n" +
                    "৬৭০/-\n" +
                    "\n ");

        }else if(data.equals("4")){

            tv1.setText("বাস রুট ও বাস ভাড়া : ");
            tv2.setText("চট্টগ্রাম\n" +
                    "\n" +
                    "০৬.১৫\n" +
                    "\n" +
                    "কক্সবাজার\n" +
                    "\n" +
                    "২১.০০\n" +
                    "\n" +
                    "০৭.৩০\n" +
                    "\n" +
                    "রাঙ্গামাটি\n" +
                    "\n" +
                    "২১.৪৫\n" +
                    "\n" +
                    "রাঙ্গামাটি\n" +
                    "\n" +
                    "০৮.০০\n" +
                    "\n" +
                    "বান্দরবন\n" +
                    "\n" +
                    "২২.১৫\n" +
                    "\n" +
                    "খাগড়াছড়ি\n" +
                    "\n" +
                    "০৮.৩০\n" +
                    "\n" +
                    "কক্সবাজার\n" +
                    "\n" +
                    "২২.৩০\n" +
                    "\n" +
                    "বান্দরবন\n" +
                    "\n" +
                    "০৮.৪৫\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "২২.৪৫\n" +
                    "\n" +
                    "কাপ্তাই\n" +
                    "\n" +
                    "০৯.১৫\n" +
                    "\n" +
                    "কাপ্তাই\n" +
                    "\n" +
                    "২২.৪৫\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "১০.০০\n" +
                    "\n" +
                    "নাজিরহাট\n" +
                    "\n" +
                    "২২.৪৫\n" +
                    "\n" +
                    "নাজিরহাট\n" +
                    "\n" +
                    "১০.৪৫\n" +
                    "\n" +
                    "কক্সবাজার\n" +
                    "\n" +
                    "২৩.১৫\n" +
                    "\n" +
                    "পটিয়া\n" +
                    "\n" +
                    "১১.৩০\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "২৩.১৫\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "১২.১৫\n" +
                    "\n" +
                    "কক্সবাজার\n" +
                    "\n" +
                    "২৩.৩০\n" +
                    "\n" +
                    "১৩.৩০\n" +
                    "\n" +
                    "খাগড়াছড়ি\n" +
                    "\n" +
                    "২৩.০০\n" +
                    "\n" +
                    "১৪.৩০\n" +
                    "\n" +
                    "২৩.৪৫\n" +
                    "\n" +
                    "১৫.৩০\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "০০.১৫\n" +
                    "\n" +
                    "১৬.৩০\n" +
                    "\n" +
                    "খাগড়াছড়ি\n" +
                    "\n" +
                    "০০.১৫\n" +
                    "\n" +
                    "১৭.৩০\n" +
                    "\n" +
                    "চট্টগ্রাম\n" +
                    "\n" +
                    "০০.৩০\n" +
                    "\n" +
                    "১৮.৪৫\n" +
                    "\n" +
                    "  ");

        }else if(data.equals("5")){

            tv1.setText("বাস রুট ও বাস ভাড়া : ");
            tv2.setText("চট্টগ্রাম\n" +
                    "\n" +
                    "৯০০/-\n" +
                    "\n" +
                    "১১৫০/-\n" +
                    "\n" +
                    "কক্সবাজার\n" +
                    "\n" +
                    "১৪০০/-\n" +
                    "\n" +
                    "১৮০০/-\n" +
                    "\n" +
                    "সিলেট\n" +
                    "\n" +
                    "৮৫০/-\n" +
                    "\n" +
                    "১১০০/-\n" +
                    "\n" +
                    "খুলনা\n" +
                    "\n" +
                    "৯৫০/-\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "যশোর\n" +
                    "\n" +
                    "৮৫০/-\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "কলকাতা\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "১৫০০/-\n" +
                    "\n" +
                    "বেনাপোল\n" +
                    "\n" +
                    "-\n" +
                    "\n" +
                    "১১০০/-\n" +
                    "\n");

        }

    }
}
